""" 
Длина Московской кольцевой автомобильной дороги —109 километров. Стартуем с нулевого километра МКАД и едем со скоростью v километров в час. На какой отметке он остановится через t часов?
Программа получает на вход значение v
и t. Если v>0, то движемся в положительном направлении по МКАД, если же значение v<0, то в отрицательном.
Программа должна вывести целое число от 0 до 108 — номер отметки, на которой остановимся
"""

v = int(input('Скорость км/ч:'))
t = int(input('Время: '))
print((v*t) % 109, 'км')
